# ElementCategoryFilter Constructor (BuiltInCategory)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementCategoryFilter Constructor (BuiltInCategory)
ElementCategoryFilter Class See Also
---
Constructs a new instance of a filter to match elements by category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementCategoryFilter(
	BuiltInCategory category
)
```

Visual Basic
---
```text
Public Sub New ( _
	category As BuiltInCategory _
)
```

Visual C++
---
```text
public:
ElementCategoryFilter(
	BuiltInCategory category
)
```

# ### Parameters
category
    Type: Autodesk.Revit.DB..::..BuiltInCategory The category to match.
# See Also
ElementCategoryFilter Class
ElementCategoryFilter Overload
Autodesk.Revit.DB Namespace